app/controllers/api/v1/designs_controller.rb

  def index
    @designs = Design.all
---
SELECT "designs".* FROM "designs"

  def create
    @design = Design.create(design_params)
    if @design.save
---
INSERT INTO "designs" ("shirtType", "shirtColor", "ringerColor", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["shirtType", "tshirt"], ["shirtColor", "#7b1fa2"], ["ringerColor", "transparent"], ["user_id", 1], ["created_at", "2019-01-22 20:49:50.875897"], ["updated_at", "2019-01-22 20:49:50.875897"]]
INSERT INTO "designs" ("shirtType", "shirtColor", "pocketColor", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["shirtType", "tshirt"], ["shirtColor", "#f8bbd0"], ["pocketColor", "#0288d1"], ["user_id", 1], ["created_at", "2019-02-19 17:56:20.087714"], ["updated_at", "2019-02-19 17:56:20.087714"]]

  def destroy
    @design.destroy
---
DELETE FROM "designs" WHERE "designs"."id" = $1  [["id", 1]]

  def find_design
    @design = Design.find(params[:id])
---
SELECT  "designs".* FROM "designs" WHERE "designs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]